using MongoDB.Driver;
using System.Collections.Generic;

namespace SemenaParse
{
    class StringsDefault
    {

        public static IMongoClient Client = new MongoClient("mongodb://localhost:27017");
        public static IMongoDatabase Database = Client.GetDatabase("SeedsInfo");
        public static IMongoDatabase DatabaseSemeNow = Client.GetDatabase("SeedsNow");
        
        public static string[] Categorys = { "Арбуз мелкая фасовка", "Артишок мелкая фасовка", "Баклажан мелкая фасовка", "Бобы мелкая фасовка", "Брюква мелкая фасовка",
                                      "Горох мелкая фасовка", "Грибы мелкая фасовка", "Дайкон мелкая фасовка", "Дыня мелкая фасовка", "Земляника мелкая фасовка",
                                      "Кабачок мелкая фасовка", "Капуста мелкая фасовка", "Картофель мелкая фасовка", "Кукуруза мелкая фасовка", "Лук мелкая фасовка",
                                      "Микрозелень мелкая фасовка", "Морковь мелкая фасовка", "Огурец мелкая фасовка", "Патиссон мелкая фасовка", "Перец мелкая фасовка",
                                      "Петрушка мелкая фасовка", "Пряность мелкая фасовка", "Редис мелкая фасовка", "Редька мелкая фасовка", "Репа мелкая фасовка",
                                      "Салат мелкая фасовка", "Свекла мелкая фасовка", "Томат мелкая фасовка", "Тыква мелкая фасовка", "Укроп мелкая фасовка",
                                      "Фасоль мелкая фасовка", "Физалис мелкая фасовка", "Щавель мелкая фасовка" };

        public static Dictionary<string, string> AlphabetRuToEn = new Dictionary<string, string>()
        {
                {"а","a"},
                {"б","b"},
                {"в","v"},
                {"г","g"},
                {"д","d"},
                {"е","e"},
                {"ё","yo"},
                {"ж","zh"},
                {"з","z"},
                {"и","i"},
                {"й","y"},
                {"к","k"},
                {"л","l"},
                {"м","m"},
                {"н","n"},
                {"о","o"},
                {"п","p"},
                {"р","r"},
                {"с","s"},
                {"т","t"},
                {"у","u"},
                {"ф","f"},
                {"х","h"},
                {"ц","ts"},
                {"ч","ch"},
                {"ш","sh"},
                {"щ","sch"},
                {"ъ",""},
                {"ы","yi"},
                {"ь",""},
                {"э","e"},
                {"ю","yu"},
                {"я","ya"},
                {" ", "-"}
        };
        public static Dictionary<string, string> ManufacterNameToId = new Dictionary<string, string>()
        {
            {"Престиж семена", "625fd412710c9a6732f1e2ee" },
            {"Россия", "625fd412710c9a6732f1e2e2" },
            {"СеДек", "625fd412710c9a6732f1e2cc" },
            {"Селекционная станция им. Н.Н.Тимофеева", "625fd412710c9a6732f1e306" },
            {"СемБат", "625fd412710c9a6732f1e2f6" },
            {"Семена Алтая", "625fd412710c9a6732f1e2d2" },
            {"Семена-М(Маштаков А.А.)", "625fd412710c9a6732f1e2f4" },
            {"Семко Юниор", "625fd412710c9a6732f1e2ce" },
            {"Сибирский сад", "625fd412710c9a6732f1e2e0" },
            {"Bejo Zaden", "625fd412710c9a6732f1e302" },
            {"Clause", "625fd412710c9a6732f1e2e4" },
            {"Enza Zaden", "625fd412710c9a6732f1e2ea" },
            {"Esasem", "625fd412710c9a6732f1e2fe" },
            {"Fito", "625fd412710c9a6732f1e300" },
            {"Greentime", "625fd412710c9a6732f1e312" },
            {"Hazera", "625fd412710c9a6732f1e2e8" },
            {"MoravoSeeds", "625fd412710c9a6732f1e30e" },
            {"Nickerson Zwaan", "625fd412710c9a6732f1e2dc" },
            {"Nunhems", "625fd412710c9a6732f1e2de" },
            {"Qualiti seed", "625fd412710c9a6732f1e2d8" },
            {"Rijk Zwaan", "625fd412710c9a6732f1e304" },
            {"Sakata", "625fd412710c9a6732f1e2d0" },
            {"Satimex", "625fd412710c9a6732f1e308" },
            {"Seminis", "625fd412710c9a6732f1e2da" },
            {"Syngenta", "625fd411710c9a6732f1e2c6" },
            {"UNIGEN SEEDS", "625fd412710c9a6732f1e2d6" },
            {"Vilmorin", "625fd412710c9a6732f1e2f2" },
            {"Wing Seed", "625fd412710c9a6732f1e2e6" },
            {"Lost manufacturer", "6252cbaea922e081a3b17eae" }
        };
        public static Dictionary<string, string> CultureNameToCategoryId = new Dictionary<string, string>()
        {
            {"Арбуз", "6252d697a922e081a3b186fa" },
            {"Артишок", "6252d717a922e081a3b18801" },
            {"Баклажан", "6252d802a922e081a3b189db" },
            {"Бобы", "6252d81ca922e081a3b18a38" },
            {"Брюква", "625e65d6710c9a6732f11363" },
            {"Горох", "625e66b0710c9a6732f1144e" },
            {"Грибы", "625e69f3710c9a6732f11b3e" },
            {"Дайкон", "625e6a41710c9a6732f11bc7" },
            {"Дыня", "625e6aa9710c9a6732f11c58" },
            {"Земляника", "625e6ad4710c9a6732f11ce9" },
            {"Кабачок", "625e6be4710c9a6732f11d88" },
            {"Капуста", "625e6c22710c9a6732f11e22" },
            {"Картофель", "625e6c53710c9a6732f11ec0" },
            {"Кукуруза", "625e6c74710c9a6732f11f62" },
            {"Лук", "625e6c9a710c9a6732f12005" },
            {"Микрозелень", "625e6cc7710c9a6732f120ae" },
            {"Морковь", "625e6cf4710c9a6732f1215d" },
            {"Огурец", "625e6d16710c9a6732f1220d" },
            {"Патиссон", "625e6d53710c9a6732f122c4" },
            {"Перец", "625e6d72710c9a6732f1237f" },
            {"Петрушка", "625e6d96710c9a6732f1243e" },
            {"Пряность", "625e6dc0710c9a6732f124fe" },
            {"Редис", "625e6de7710c9a6732f125c5" },
            {"Редька", "625e6e27710c9a6732f12690" },
            {"Репа", "625e6e59710c9a6732f1275f" },
            {"Салат", "625e6e8c710c9a6732f12832" },
            {"Свекла", "625e6f16710c9a6732f12a1f" },
            {"Томат", "625e6f4b710c9a6732f12afa" },
            {"Тыква", "625e6f7e710c9a6732f12bd9" },
            {"Укроп", "625e6fbf710c9a6732f12d9b" },
            {"Фасоль", "625e6fec710c9a6732f12e7f" },
            {"Физалис", "625e706c710c9a6732f13199" },
            {"Щавель", "625e7091710c9a6732f13285" },
            {"Lost category", "625ff534710c9a6732f20209" }
        };
    }
}
